/*!
 * Copyright (c) 2010 "Michael He"
 * Dual licensed under the MIT and GPL licenses.
 */

// GitHub          - http://github.com/hlxwell/jquery-cityselector/
// jQuery Versions - 1.4.2
// Browsers Tested - Internet Explorer 6-8, Firefox 2-3.7, Safari 3-4, Chrome 4-5, Opera 9.6-10.1.

// Usage 
// <div class="city_selector">
//  <select class="province"></select> 
//  <select class="city"></select>
// </div>
// $('.city_selector').CitySelector();

$.fn.CitySelector = function(){
  var _self = this;
  var _province = _self.find("select.province")[0];
  var _city = _self.find("select.city")[0];
  var _citylist = [
	[{"pname":"北京市","pid":"110000"},{"cid":"110000","cname":"北京市"}],
	[{"pname":"天津市","pid":"120000"},{"cid":"120000","cname":"天津市"}],
	[{"pname":"河北省","pid":"130000"},{"cid":"130100","cname":"石家庄市"},{"cid":"130200","cname":"唐山市"},{"cid":"130300","cname":"秦皇岛市"},{"cid":"130400","cname":"邯郸市"},{"cid":"130500","cname":"邢台市"},{"cid":"130600","cname":"保定市"},{"cid":"130700","cname":"张家口市"},{"cid":"130800","cname":"承德市"},{"cid":"130900","cname":"沧州市"},{"cid":"131000","cname":"廊坊市"},{"cid":"131100","cname":"衡水市"}],
	[{"pname":"山西省","pid":"140000"},{"cid":"140100","cname":"太原市"},{"cid":"140200","cname":"大同市"},{"cid":"140300","cname":"阳泉市"},{"cid":"140400","cname":"长治市"},{"cid":"140500","cname":"晋城市"},{"cid":"140600","cname":"朔州市"},{"cid":"140700","cname":"晋中市"},{"cid":"140800","cname":"运城市"},{"cid":"140900","cname":"忻州市"},{"cid":"141000","cname":"临汾市"},{"cid":"141100","cname":"吕梁市"}],
	[{"pname":"内蒙古自治区","pid":"150000"},{"cid":"150100","cname":"呼和浩特市"},{"cid":"150200","cname":"包头市"},{"cid":"150300","cname":"乌海市"},{"cid":"150400","cname":"赤峰市"},{"cid":"150500","cname":"通辽市"},{"cid":"150600","cname":"鄂尔多斯市"},{"cid":"150700","cname":"呼伦贝尔市"},{"cid":"150800","cname":"巴彦淖尔市"},{"cid":"150900","cname":"乌兰察布市"},{"cid":"152200","cname":"兴安盟"},{"cid":"152500","cname":"锡林郭勒盟"},{"cid":"152900","cname":"阿拉善盟"}],
	[{"pname":"辽宁省","pid":"210000"},{"cid":"210100","cname":"沈阳市"},{"cid":"210200","cname":"大连市"},{"cid":"210300","cname":"鞍山市"},{"cid":"210400","cname":"抚顺市"},{"cid":"210500","cname":"本溪市"},{"cid":"210600","cname":"丹东市"},{"cid":"210700","cname":"锦州市"},{"cid":"210800","cname":"营口市"},{"cid":"210900","cname":"阜新市"},{"cid":"211000","cname":"辽阳市"},{"cid":"211100","cname":"盘锦市"},{"cid":"211200","cname":"铁岭市"},{"cid":"211300","cname":"朝阳市"},{"cid":"211400","cname":"葫芦岛市"}],
	[{"pname":"吉林省","pid":"220000"},{"cid":"220100","cname":"长春市"},{"cid":"220200","cname":"吉林市"},{"cid":"220300","cname":"四平市"},{"cid":"220400","cname":"辽源市"},{"cid":"220500","cname":"通化市"},{"cid":"220600","cname":"白山市"},{"cid":"220700","cname":"松原市"},{"cid":"220800","cname":"白城市"},{"cid":"222400","cname":"延边朝鲜族自治州"}],
	[{"pname":"黑龙江省","pid":"230000"},{"cid":"230100","cname":"哈尔滨市"},{"cid":"230200","cname":"齐齐哈尔市"},{"cid":"230300","cname":"鸡西市"},{"cid":"230400","cname":"鹤岗市"},{"cid":"230500","cname":"双鸭山市"},{"cid":"230600","cname":"大庆市"},{"cid":"230700","cname":"伊春市"},{"cid":"230800","cname":"佳木斯市"},{"cid":"230900","cname":"七台河市"},{"cid":"231000","cname":"牡丹江市"},{"cid":"231100","cname":"黑河市"},{"cid":"231200","cname":"绥化市"},{"cid":"232700","cname":"大兴安岭地区"}],
	[{"pname":"上海市","pid":"310000"},{"cid":"310000","cname":"上海市"}],
	[{"pname":"江苏省","pid":"320000"},{"cid":"320100","cname":"南京市"},{"cid":"320200","cname":"无锡市"},{"cid":"320300","cname":"徐州市"},{"cid":"320400","cname":"常州市"},{"cid":"320500","cname":"苏州市"},{"cid":"320600","cname":"南通市"},{"cid":"320700","cname":"连云港市"},{"cid":"320800","cname":"淮安市"},{"cid":"320900","cname":"盐城市"},{"cid":"321000","cname":"扬州市"},{"cid":"321100","cname":"镇江市"},{"cid":"321200","cname":"泰州市"},{"cid":"321300","cname":"宿迁市"}],
	[{"pname":"浙江省","pid":"330000"},{"cid":"330100","cname":"杭州市"},{"cid":"330200","cname":"宁波市"},{"cid":"330300","cname":"温州市"},{"cid":"330400","cname":"嘉兴市"},{"cid":"330500","cname":"湖州市"},{"cid":"330600","cname":"绍兴市"},{"cid":"330700","cname":"金华市"},{"cid":"330800","cname":"衢州市"},{"cid":"330900","cname":"舟山市"},{"cid":"331000","cname":"台州市"},{"cid":"331100","cname":"丽水市"}],
	[{"pname":"安徽省","pid":"340000"},{"cid":"340100","cname":"合肥市"},{"cid":"340200","cname":"芜湖市"},{"cid":"340300","cname":"蚌埠市"},{"cid":"340400","cname":"淮南市"},{"cid":"340500","cname":"马鞍山市"},{"cid":"340600","cname":"淮北市"},{"cid":"340700","cname":"铜陵市"},{"cid":"340800","cname":"安庆市"},{"cid":"341000","cname":"黄山市"},{"cid":"341100","cname":"滁州市"},{"cid":"341200","cname":"阜阳市"},{"cid":"341300","cname":"宿州市"},{"cid":"341500","cname":"六安市"},{"cid":"341600","cname":"亳州市"},{"cid":"341700","cname":"池州市"},{"cid":"341800","cname":"宣城市"}],
	[{"pname":"福建省","pid":"350000"},{"cid":"350100","cname":"福州市"},{"cid":"350200","cname":"厦门市"},{"cid":"350300","cname":"莆田市"},{"cid":"350400","cname":"三明市"},{"cid":"350500","cname":"泉州市"},{"cid":"350600","cname":"漳州市"},{"cid":"350700","cname":"南平市"},{"cid":"350800","cname":"龙岩市"},{"cid":"350900","cname":"宁德市"}],
	[{"pname":"江西省","pid":"360000"},{"cid":"360100","cname":"南昌市"},{"cid":"360200","cname":"景德镇市"},{"cid":"360300","cname":"萍乡市"},{"cid":"360400","cname":"九江市"},{"cid":"360500","cname":"新余市"},{"cid":"360600","cname":"鹰潭市"},{"cid":"360700","cname":"赣州市"},{"cid":"360800","cname":"吉安市"},{"cid":"360900","cname":"宜春市"},{"cid":"361000","cname":"抚州市"},{"cid":"361100","cname":"上饶市"}],
	[{"pname":"山东省","pid":"370000"},{"cid":"370100","cname":"济南市"},{"cid":"370200","cname":"青岛市"},{"cid":"370300","cname":"淄博市"},{"cid":"370400","cname":"枣庄市"},{"cid":"370500","cname":"东营市"},{"cid":"370600","cname":"烟台市"},{"cid":"370700","cname":"潍坊市"},{"cid":"370800","cname":"济宁市"},{"cid":"370900","cname":"泰安市"},{"cid":"371000","cname":"威海市"},{"cid":"371100","cname":"日照市"},{"cid":"371200","cname":"莱芜市"},{"cid":"371300","cname":"临沂市"},{"cid":"371400","cname":"德州市"},{"cid":"371500","cname":"聊城市"},{"cid":"371600","cname":"滨州市"},{"cid":"371700","cname":"菏泽市"}],
	[{"pname":"河南省","pid":"410000"},{"cid":"410100","cname":"郑州市"},{"cid":"410200","cname":"开封市"},{"cid":"410300","cname":"洛阳市"},{"cid":"410400","cname":"平顶山市"},{"cid":"410500","cname":"安阳市"},{"cid":"410600","cname":"鹤壁市"},{"cid":"410700","cname":"新乡市"},{"cid":"410800","cname":"焦作市"},{"cid":"410900","cname":"濮阳市"},{"cid":"411000","cname":"许昌市"},{"cid":"411100","cname":"漯河市"},{"cid":"411200","cname":"三门峡市"},{"cid":"411300","cname":"南阳市"},{"cid":"411400","cname":"商丘市"},{"cid":"411500","cname":"信阳市"},{"cid":"411600","cname":"周口市"},{"cid":"411700","cname":"驻马店市"},{"cid":"419000","cname":"省直辖县级行政区划"}],
	[{"pname":"湖北省","pid":"420000"},{"cid":"420100","cname":"武汉市"},{"cid":"420200","cname":"黄石市"},{"cid":"420300","cname":"十堰市"},{"cid":"420500","cname":"宜昌市"},{"cid":"420600","cname":"襄阳市"},{"cid":"420700","cname":"鄂州市"},{"cid":"420800","cname":"荆门市"},{"cid":"420900","cname":"孝感市"},{"cid":"421000","cname":"荆州市"},{"cid":"421100","cname":"黄冈市"},{"cid":"421200","cname":"咸宁市"},{"cid":"421300","cname":"随州市"},{"cid":"422800","cname":"恩施土家族苗族自治州"},{"cid":"429000","cname":"省直辖县级行政区划"}],
	[{"pname":"湖南省","pid":"430000"},{"cid":"430100","cname":"长沙市"},{"cid":"430200","cname":"株洲市"},{"cid":"430300","cname":"湘潭市"},{"cid":"430400","cname":"衡阳市"},{"cid":"430500","cname":"邵阳市"},{"cid":"430600","cname":"岳阳市"},{"cid":"430700","cname":"常德市"},{"cid":"430800","cname":"张家界市"},{"cid":"430900","cname":"益阳市"},{"cid":"431000","cname":"郴州市"},{"cid":"431100","cname":"永州市"},{"cid":"431200","cname":"怀化市"},{"cid":"431300","cname":"娄底市"},{"cid":"433100","cname":"湘西土家族苗族自治州"}],
	[{"pname":"广东省","pid":"440000"},{"cid":"440100","cname":"广州市"},{"cid":"440200","cname":"韶关市"},{"cid":"440300","cname":"深圳市"},{"cid":"440400","cname":"珠海市"},{"cid":"440500","cname":"汕头市"},{"cid":"440600","cname":"佛山市"},{"cid":"440700","cname":"江门市"},{"cid":"440800","cname":"湛江市"},{"cid":"440900","cname":"茂名市"},{"cid":"441200","cname":"肇庆市"},{"cid":"441300","cname":"惠州市"},{"cid":"441400","cname":"梅州市"},{"cid":"441500","cname":"汕尾市"},{"cid":"441600","cname":"河源市"},{"cid":"441700","cname":"阳江市"},{"cid":"441800","cname":"清远市"},{"cid":"441900","cname":"东莞市"},{"cid":"442000","cname":"中山市"},{"cid":"445100","cname":"潮州市"},{"cid":"445200","cname":"揭阳市"},{"cid":"445300","cname":"云浮市"}],
	[{"pname":"广西壮族自治区","pid":"450000"},{"cid":"450100","cname":"南宁市"},{"cid":"450200","cname":"柳州市"},{"cid":"450300","cname":"桂林市"},{"cid":"450400","cname":"梧州市"},{"cid":"450500","cname":"北海市"},{"cid":"450600","cname":"防城港市"},{"cid":"450700","cname":"钦州市"},{"cid":"450800","cname":"贵港市"},{"cid":"450900","cname":"玉林市"},{"cid":"451000","cname":"百色市"},{"cid":"451100","cname":"贺州市"},{"cid":"451200","cname":"河池市"},{"cid":"451300","cname":"来宾市"},{"cid":"451400","cname":"崇左市"}],
	[{"pname":"海南省","pid":"460000"},{"cid":"460100","cname":"海口市"},{"cid":"460200","cname":"三亚市"},{"cid":"460300","cname":"三沙市"},{"cid":"469000","cname":"省直辖县级行政区划"}],
	[{"pname":"重庆市","pid":"500000"},{"cid":"500000","cname":"重庆市"}],
	[{"pname":"四川省","pid":"510000"},{"cid":"510100","cname":"成都市"},{"cid":"510300","cname":"自贡市"},{"cid":"510400","cname":"攀枝花市"},{"cid":"510500","cname":"泸州市"},{"cid":"510600","cname":"德阳市"},{"cid":"510700","cname":"绵阳市"},{"cid":"510800","cname":"广元市"},{"cid":"510900","cname":"遂宁市"},{"cid":"511000","cname":"内江市"},{"cid":"511100","cname":"乐山市"},{"cid":"511300","cname":"南充市"},{"cid":"511400","cname":"眉山市"},{"cid":"511500","cname":"宜宾市"},{"cid":"511600","cname":"广安市"},{"cid":"511700","cname":"达州市"},{"cid":"511800","cname":"雅安市"},{"cid":"511900","cname":"巴中市"},{"cid":"512000","cname":"资阳市"},{"cid":"513200","cname":"阿坝藏族羌族自治州"},{"cid":"513300","cname":"甘孜藏族自治州"},{"cid":"513400","cname":"凉山彝族自治州"}],
	[{"pname":"贵州省","pid":"520000"},{"cid":"520100","cname":"贵阳市"},{"cid":"520200","cname":"六盘水市"},{"cid":"520300","cname":"遵义市"},{"cid":"520400","cname":"安顺市"},{"cid":"520500","cname":"毕节市"},{"cid":"520600","cname":"铜仁市"},{"cid":"522300","cname":"黔西南布依族苗族自治州"},{"cid":"522600","cname":"黔东南苗族侗族自治州"},{"cid":"522700","cname":"黔南布依族苗族自治州"}],
	[{"pname":"云南省","pid":"530000"},{"cid":"530100","cname":"昆明市"},{"cid":"530300","cname":"曲靖市"},{"cid":"530400","cname":"玉溪市"},{"cid":"530500","cname":"保山市"},{"cid":"530600","cname":"昭通市"},{"cid":"530700","cname":"丽江市"},{"cid":"530800","cname":"普洱市"},{"cid":"530900","cname":"临沧市"},{"cid":"532300","cname":"楚雄彝族自治州"},{"cid":"532500","cname":"红河哈尼族彝族自治州"},{"cid":"532600","cname":"文山壮族苗族自治州"},{"cid":"532800","cname":"西双版纳傣族自治州"},{"cid":"532900","cname":"大理白族自治州"},{"cid":"533100","cname":"德宏傣族景颇族自治州"},{"cid":"533300","cname":"怒江傈僳族自治州"},{"cid":"533400","cname":"迪庆藏族自治州"}],
	[{"pname":"西藏自治区","pid":"540000"},{"cid":"540100","cname":"拉萨市"},{"cid":"542100","cname":"昌都地区"},{"cid":"542200","cname":"山南地区"},{"cid":"542300","cname":"日喀则地区"},{"cid":"542400","cname":"那曲地区"},{"cid":"542500","cname":"阿里地区"},{"cid":"542600","cname":"林芝地区"}],
	[{"pname":"陕西省","pid":"610000"},{"cid":"610100","cname":"西安市"},{"cid":"610200","cname":"铜川市"},{"cid":"610300","cname":"宝鸡市"},{"cid":"610400","cname":"咸阳市"},{"cid":"610500","cname":"渭南市"},{"cid":"610600","cname":"延安市"},{"cid":"610700","cname":"汉中市"},{"cid":"610800","cname":"榆林市"},{"cid":"610900","cname":"安康市"},{"cid":"611000","cname":"商洛市"}],
	[{"pname":"甘肃省","pid":"620000"},{"cid":"620100","cname":"兰州市"},{"cid":"620200","cname":"嘉峪关市"},{"cid":"620300","cname":"金昌市"},{"cid":"620400","cname":"白银市"},{"cid":"620500","cname":"天水市"},{"cid":"620600","cname":"武威市"},{"cid":"620700","cname":"张掖市"},{"cid":"620800","cname":"平凉市"},{"cid":"620900","cname":"酒泉市"},{"cid":"621000","cname":"庆阳市"},{"cid":"621100","cname":"定西市"},{"cid":"621200","cname":"陇南市"},{"cid":"622900","cname":"临夏回族自治州"},{"cid":"623000","cname":"甘南藏族自治州"}],
	[{"pname":"青海省","pid":"630000"},{"cid":"630100","cname":"西宁市"},{"cid":"630200","cname":"海东市"},{"cid":"632200","cname":"海北藏族自治州"},{"cid":"632300","cname":"黄南藏族自治州"},{"cid":"632500","cname":"海南藏族自治州"},{"cid":"632600","cname":"果洛藏族自治州"},{"cid":"632700","cname":"玉树藏族自治州"},{"cid":"632800","cname":"海西蒙古族藏族自治州"}],
	[{"pname":"宁夏回族自治区","pid":"640000"},{"cid":"640100","cname":"银川市"},{"cid":"640200","cname":"石嘴山市"},{"cid":"640300","cname":"吴忠市"},{"cid":"640400","cname":"固原市"},{"cid":"640500","cname":"中卫市"}],
	[{"pname":"新疆维吾尔自治区","pid":"650000"},{"cid":"650100","cname":"乌鲁木齐市"},{"cid":"650200","cname":"克拉玛依市"},{"cid":"652100","cname":"吐鲁番地区"},{"cid":"652200","cname":"哈密地区"},{"cid":"652300","cname":"昌吉回族自治州"},{"cid":"652700","cname":"博尔塔拉蒙古自治州"},{"cid":"652800","cname":"巴音郭楞蒙古自治州"},{"cid":"652900","cname":"阿克苏地区"},{"cid":"653000","cname":"克孜勒苏柯尔克孜自治州"},{"cid":"653100","cname":"喀什地区"},{"cid":"653200","cname":"和田地区"},{"cid":"654000","cname":"伊犁哈萨克自治州"},{"cid":"654200","cname":"塔城地区"},{"cid":"654300","cname":"阿勒泰地区"},{"cid":"659000","cname":"自治区直辖县级行政区划"}],
	[{"pname":"台湾省","pid":"710000"}, {"cname":"台湾省","cid":"710000"}],
	[{"pname":"香港特别行政区","pid":"810000"}, {"cname":"香港特别行政区","cid":"810000"}],
	[{"pname":"澳门特别行政区","pid":"820000"}, {"cname":"澳门特别行政区","cid":"820000"}]
  ];

  function addProvincesOption() {
    $(_province).html("<option value=''>请选择</option>");
    $(_city).html("<option value=''>请选择</option>");

    $.each( _citylist, function(i, n){
      $("<option value='" + n[0].pid + "'>" + n[0].pname + "</option>").appendTo($(_province));
    });
  }

  function provinceChanged() {
    //clear city options
    $(_city).html("<option value=''>请选择</option>");
    
	$.each( _citylist, function(i, n){
      if(_province.value == n[0].pid) {
        // add city options
        $.each( _citylist[i], function(j, m){
          if(j > 0) {
            $("<option value='" + m.cid + "'>" + m.cname + "</option>").appendTo($(_city));
          }
        });
      }
    });
  }
  
  function cityChange(){
	alert(_province.value + " " + _city.value);
  }

  // add province list and change event.
  if(_province) {
    addProvincesOption();
  } else {
    alert("Please specify a province selector.")
  }
  if(_city) { $(_province).change(provinceChanged); }
  
  $(_city).change(cityChange);
};
